Documents/ПроизводствоИПродажаБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроизводствоИПродажаБлюд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиБлюд</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладахПартии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураБлюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТехнологическиеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБлюдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБлюдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладахПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладахПартии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыИнгредиентов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыИнгредиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПроизводствоИПродажаБлюд/Ext/ManagerModule.bsl
Функция ОбязательныеРеквизиты() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Ответственный");
	Возврат МассивРеквизитов;	
КонецФункции

Функция ОбязательныеРеквизитыТЧ() Экспорт
	Результат = Новый Структура;
    Результат.Вставить("Продукты", СтрРазделить("Номенклатура,Количество", ","));
    Результат.Вставить("Блюда", СтрРазделить("Блюдо,Количество,Стоимость", ","));   
    Возврат Результат;
КонецФункции

Функция ТаблицаДляПроведения(Ссылка, Период, Отказ) Экспорт
	
	ИсточникОбъект = Ссылка.ПолучитьОбъект();
	Связи = Новый Структура("ИмяТЧ, Номенклатура", "Продукты", "Номенклатура");
	ТЗ_Блокировок = ОбщиеФункцииСервер.ПодготовитьТаблицуБлокировок("РегистрНакопления.ТоварыНаСкладахПартии", ИсточникОбъект, Связи);
	ОбщиеФункцииСервер.ЗаблокироватьИзмеренияРегистра("РегистрНакопления.ТоварыНаСкладахПартии", ТЗ_Блокировок);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст= 
	"ВЫБРАТЬ
	|	ПР.Номенклатура,
	|	ПР.Количество,
	|	ПР.КлючСвязи,
	|	&Период КАК Период
	|ПОМЕСТИТЬ ВТ_Продукты
	|ИЗ
	|	Документ.ПроизводствоИПродажаБлюд.Продукты КАК ПР
	|ГДЕ
	|	ПР.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	| ПР.КлючСвязи,
	| ПР.Количество КАК НужноСписать,
	| Остатки.Номенклатура,
	| Остатки.Партия,
	| Остатки.КоличествоОстаток КАК КолОстаток,
	| Остатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	| ВТ_Продукты КАК ПР
	| 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладахПартии.Остатки(&Граница,
	| 	Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТ_Продукты)) КАК Остатки
	| ПО ПР.Номенклатура = Остатки.Номенклатура
	| УПОРЯДОЧИТЬ ПО Остатки.Партии.МоментВремени ВОЗР
	|;
	|ВЫБРАТЬ
	|	БЛ.НоменклатураБлюдо,
	|	БЛ.КоличествоБлюдо,
	|	БЛ.СуммаБлюдо,
	|	БЛ.НомерСтроки КАК КлючСвязи
	|ИЗ
	|	Документ.ПроизводствоИПродажаБлюд.Блюда КАК БЛ
	|ГДЕ
	| БЛ.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Пр.КлючСвязи,
	|	СУММА(Пр.Количество * ЕСТЬNULL(Значения.Значение, 0)) КАК КалорийностьБлюда
	|ИЗ
	|	ВТ_Продукты КАК Пр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровНоменклатуры КАК Значения
	|		ПО Пр.Номенклатура = Значения.Номенклатура
	|		И Значения.ВидПараметра = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыИнгредиентов.КБЖУ.Калорийность)
	|СГРУППИРОВАТЬ ПО
	|	Пр.КлючСвязи";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", Период);
	Пакет = Запрос.ВыполнитьПакет();
	РезультатРаспределения = РаспределитьПартии(Пакет[1].Выгрузить(), Отказ);
	
	Таблица = Новый Структура;
	Таблица.Вставить("ТоварыНаСкладахПартии", РезультатРаспределения.ТаблицаДляРегистра);
    Таблица.Вставить("ТоварыНаСкладах",       РезультатРаспределения.ТаблицаДляРегистра);
	
	Таблица.Вставить("ПродажиБлюд", СобратьДанныеПродаж(Пакет[2].Выгрузить(), РезультатРаспределения.СебестоимостьПоКлючам, Пакет[3].Выгрузить()));
	Возврат Таблица;
КонецФункции

Функция РаспределитьПартии(ТаблицаОстатков, Отказ)
	ТЗ_Движения = Новый ТаблицаЗначений;
	ТЗ_Движения.Колонки.Добавить("Номенклатура");
	ТЗ_Движения.Колонки.Добавить("Партия");
	ТЗ_Движения.Колонки.Добавить("ВидДвижения");
	ТЗ_Движения.Колонки.Добавить("Количество");
	ТЗ_Движения.Колонки.Добавить("Сумма");
	
	СебестоимостьПоКлючам = Новый Соответствие;
	
	ТЗ_Нужды = ТаблицаОстатков.Скопировать();
	ТЗ_Нужды.Свернуть("КлючСвязи, Номенклатура, НужноСписать");
	
	Для Каждого СтрНужды Из ТЗ_Нужды Цикл
		ОсталосьСписать = СтрНужды.НужноСписать;
		ТекущаяСебестоимость = 0;
		Отбор = Новый Структура("Номенклатура", СтрНужды.Номенклатура);
		СтрокиПартий = ТаблицаОстатков.НайтиСтроки(Отбор);
		
		Для Каждого СтрПартии Из СтрокиПартий Цикл
			Если ОсталосьСписать <=0 Тогда Прервать; КонецЕсли;
			
			ВзятьИзПартии = Мин(ОсталосьСписать, СтрПартии.КолОстаток);
			Если ВзятьИзПартии = СтрПартии.КолОстаток Тогда
				СуммаСписания = СтрПартии.СуммаОстаток;
			Иначе
				СуммаСписания = Окр(СтрПартии.СуммаОстаток * ВзятьИзПартии / СтрПартии.КолОстаток, 2);
			КонецЕсли;
			
			НоваяСтрока = ТЗ_Движения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрПартии);
			НоваяСтрока.Количество = ВзятьИзПартии;
			НоваяСтрока.Сумма = СуммаСписания;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			ТекущаяСебестоимость = ТекущаяСебестоимость + СуммаСписания;
			ОсталосьСписать = ОсталосьСписать - ВзятьИзПартии;
		КонецЦикла;
		Если ОсталосьСписать > 0 Тогда
			ТекстОшибки = СтрШаблон("Недостаточно Продуктов '%1'. Нужно еще %2 ед.", 
                                СтрНужды.Номенклатура, ОсталосьСписать);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,"Продукты",,Отказ);
		КонецЕсли;
		ВсегоРанее = СебестоимостьПоКлючам.Получить(СтрНужды.КлючСвязи);
		СебестоимостьПоКлючам.Вставить(СтрНужды.КлючСвязи, ?(ВсегоРанее = Неопределено, 0, ВсегоРанее) + ТекущаяСебестоимость);
	КонецЦикла;
	Возврат Новый Структура("ТаблицаДляРегистра, СебестоимостьПоКлючам", ТЗ_Движения, СебестоимостьПоКлючам);
КонецФункции

Функция СобратьДанныеПродаж(ТаблицаБлюд, СебестоимостьПоКлючам, ТаблицаКБЖУ) 
	ТЗ_Продажи = ТаблицаБлюд.Скопировать();
	ТЗ_Продажи.Колонки.Добавить("СебестоимостьБлюдо");
	ТЗ_Продажи.Колонки.Добавить("ПрибыльБлюдо");
	ТЗ_Продажи.Колонки.Добавить("Калорийность");
    ТЗ_Продажи.Колонки.Добавить("Белки");
    ТЗ_Продажи.Колонки.Добавить("Жиры");
    ТЗ_Продажи.Колонки.Добавить("Углеводы");
	Для Каждого Стр Из ТЗ_Продажи Цикл
		Себестоимость = СебестоимостьПоКлючам.Получить(Стр.КлючСвязи);
		Стр.СебестоимостьБлюдо = ?(Себестоимость = Неопределено, 0, Себестоимость);
		Отбор = Новый Структура("КлючСвязи", Стр.КлючСвязи);
        СтрокиКБЖУ = ТаблицаКБЖУ.НайтиСтроки(Отбор);
        Если СтрокиКБЖУ.Количество() > 0 Тогда
            ЗаполнитьЗначенияСвойств(Стр, СтрокиКБЖУ[0]);
        КонецЕсли;
		Стр.ПрибыльБлюдо = Стр.СуммаБлюдо - Стр.СебестоимостьБлюдо;
	КонецЦикла;
	Возврат ТЗ_Продажи;
КонецФункции
